tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "buo/cask-upgrade"
tap "homebrew/cask-fonts"

# Editors
cask "visual-studio-code"
# cask "sublime-text"
cask "pycharm"
brew "vim"

# Terminal
cask "iterm2"

# Shell
brew "fish"

# Languages
# brew "python3"
brew "ruby"
# brew "node"
# brew "go"
brew "pyenv"
brew "pyenv-virtualenv"
brew "nvm"
brew "yarn"


# Tools
# brew "coreutils"
brew "curl"
brew "wget"
brew "ack"
brew "git-flow"
brew "p7zip"
# cask "vlc"
cask "meld"
cask "p4v"
brew "pre-commit"
# cask "flux"
brew "tmux"
cask "rar"
brew "exa"
brew "openssh"

# Docker
cask "docker"

# Browsers
brew "lynx"
# cask "google-chrome"
cask "firefox"
cask  "brave-browser"
# cask "torbrowser"

# Cloud CLI
# cask "google-cloud-sdk"
# brew "awscli"
# brew "firebase-cli"

# Database
# brew "rethinkdb"
# brew "mongodb"
# brew "postgresql"
# brew "mysql"
# cask "dbeaver-community"

# Optional
cask "slack"
# cask "lastpass"
